
## :x: Apply Failed

[CI link](https://github.com/mirror-kt/infra/actions/runs/5432259837)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/9c1ce3ee-239e-447a-bdea-1366d0157a6f/terraform-bin apply -no-color -input=false -auto-approve
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infra/infra/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infra/infra

To view this run in a browser, visit:
https://app.terraform.io/app/mirror_kt/infra/runs/run-c9h6rWxULGbSkD9a

Waiting for 1 run(s) to finish before being queued...
Waiting for 1 run(s) to finish before being queued... (30s elapsed)

Terraform v1.5.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.dmarc will be created
  + resource "cloudflare_record" "dmarc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=quarantine; rua=mailto:dmarc@mirror-kt.dev"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.dub_sh will be created
  + resource "cloudflare_record" "dub_sh" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "s"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "cname.dub.sh"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.github_pages_challenge will be created
  + resource "cloudflare_record" "github_pages_challenge" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_github-pages-challenge-mirror-kt"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "5ccd0ccb2e561700cb4bc02bfb98f1"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.keybase will be created
  + resource "cloudflare_record" "keybase" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_keybase"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=BUwOwC7eaSNWlnpB9toKGrkWPbK8Mnx5C4p1_PxLENE"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.mail will be created
  + resource "cloudflare_record" "mail" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mirror-kt.dev"
      + priority        = 0
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "www2800.sakura.ne.jp"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.mc_chun_1 will be created
  + resource "cloudflare_record" "mc_chun_1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mc.chun"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "NS"
      + value           = "columbus.aternos.org"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.mc_chun_2 will be created
  + resource "cloudflare_record" "mc_chun_2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mc.chun"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "NS"
      + value           = "galileo.aternos.org"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.pleroma will be created
  + resource "cloudflare_record" "pleroma" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pleroma"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "A"
      + value           = "34.134.233.145"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.root will be created
  + resource "cloudflare_record" "root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mirror-kt.dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "mirror-kt.pages.dev"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.spf will be created
  + resource "cloudflare_record" "spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mirror-kt.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 include:www2800.sakura.ne.jp ~all"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

Plan: 10 to add, 0 to change, 0 to destroy.


cloudflare_record.spf: Creating...
cloudflare_record.pleroma: Creating...
cloudflare_record.keybase: Creating...
cloudflare_record.mc_chun_1: Creating...
cloudflare_record.root: Creating...
cloudflare_record.mc_chun_2: Creating...
cloudflare_record.dub_sh: Creating...
cloudflare_record.mail: Creating...
cloudflare_record.dmarc: Creating...
cloudflare_record.github_pages_challenge: Still creating... [10s elapsed]
cloudflare_record.keybase: Still creating... [10s elapsed]
cloudflare_record.pleroma: Still creating... [10s elapsed]
cloudflare_record.spf: Still creating... [10s elapsed]
cloudflare_record.mc_chun_1: Still creating... [10s elapsed]
cloudflare_record.root: Still creating... [10s elapsed]
cloudflare_record.mc_chun_2: Still creating... [10s elapsed]
cloudflare_record.dub_sh: Still creating... [10s elapsed]
cloudflare_record.dmarc: Still creating... [10s elapsed]
cloudflare_record.mail: Still creating... [10s elapsed]
cloudflare_record.github_pages_challenge: Still creating... [20s elapsed]
cloudflare_record.spf: Still creating... [20s elapsed]
cloudflare_record.pleroma: Still creating... [20s elapsed]
cloudflare_record.keybase: Still creating... [20s elapsed]
cloudflare_record.mc_chun_1: Still creating... [20s elapsed]
cloudflare_record.root: Still creating... [20s elapsed]
cloudflare_record.mc_chun_2: Still creating... [20s elapsed]
cloudflare_record.dub_sh: Still creating... [20s elapsed]
cloudflare_record.mail: Still creating... [20s elapsed]
cloudflare_record.dmarc: Still creating... [20s elapsed]
cloudflare_record.github_pages_challenge: Still creating... [30s elapsed]
cloudflare_record.pleroma: Still creating... [30s elapsed]
cloudflare_record.spf: Still creating... [30s elapsed]
cloudflare_record.keybase: Still creating... [30s elapsed]
cloudflare_record.root: Still creating... [30s elapsed]
cloudflare_record.mc_chun_1: Still creating... [30s elapsed]
cloudflare_record.mc_chun_2: Still creating... [30s elapsed]
cloudflare_record.dub_sh: Still creating... [30s elapsed]
cloudflare_record.mail: Still creating... [30s elapsed]
cloudflare_record.dmarc: Still creating... [30s elapsed]
╷
│ Error: expected DNS record to not already be present but already exists
│ 
│   with cloudflare_record.pleroma,
│   on cloudflare_dns_records.tf line 1, in resource "cloudflare_record" "pleroma":
│    1: resource "cloudflare_record" "pleroma" {
│ 
╵
╷
│ Error: expected DNS record to not already be present but already exists
│ 
│   with cloudflare_record.root,
│   on cloudflare_dns_records.tf line 10, in resource "cloudflare_record" "root":
│   10: resource "cloudflare_record" "root" {
│ 
╵
╷
│ Error: expected DNS record to not already be present but already exists
│ 
│   with cloudflare_record.dub_sh,
│   on cloudflare_dns_records.tf line 19, in resource "cloudflare_record" "dub_sh":
│   19: resource "cloudflare_record" "dub_sh" {
│ 
╵
╷
│ Error: expected DNS record to not already be present but already exists
│ 
│   with cloudflare_record.mail,
│   on cloudflare_dns_records.tf line 28, in resource "cloudflare_record" "mail":
│   28: resource "cloudflare_record" "mail" {
│ 
╵
╷
│ Error: expected DNS record to not already be present but already exists
│ 
│   with cloudflare_record.spf,
│   on cloudflare_dns_records.tf line 38, in resource "cloudflare_record" "spf":
│   38: resource "cloudflare_record" "spf" {
│ 
╵
╷
│ Error: expected DNS record to not already be present but already exists
│ 
│   with cloudflare_record.mc_chun_1,
│   on cloudflare_dns_records.tf line 47, in resource "cloudflare_record" "mc_chun_1":
│   47: resource "cloudflare_record" "mc_chun_1" {
│ 
╵
╷
│ Error: expected DNS record to not already be present but already exists
│ 
│   with cloudflare_record.mc_chun_2,
│   on cloudflare_dns_records.tf line 56, in resource "cloudflare_record" "mc_chun_2":
│   56: resource "cloudflare_record" "mc_chun_2" {
│ 
╵
╷
│ Error: expected DNS record to not already be present but already exists
│ 
│   with cloudflare_record.dmarc,
│   on cloudflare_dns_records.tf line 65, in resource "cloudflare_record" "dmarc":
│   65: resource "cloudflare_record" "dmarc" {
│ 
╵
╷
│ Error: expected DNS record to not already be present but already exists
│ 
│   with cloudflare_record.github_pages_challenge,
│   on cloudflare_dns_records.tf line 74, in resource "cloudflare_record" "github_pages_challenge":
│   74: resource "cloudflare_record" "github_pages_challenge" {
│ 
╵
╷
│ Error: expected DNS record to not already be present but already exists
│ 
│   with cloudflare_record.keybase,
│   on cloudflare_dns_records.tf line 83, in resource "cloudflare_record" "keybase":
│   83: resource "cloudflare_record" "keybase" {
│ 
╵
Operation failed: failed running terraform apply (exit 1)
::debug::Terraform exited with code 1.
::debug::stdout: Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C%0Awill cancel the remote apply if it's still pending. If the apply started it%0Awill stop streaming the logs, but will not stop the apply running remotely.%0A%0APreparing the remote apply...%0A%0AThe remote workspace is configured to work with configuration at%0Aterraform relative to the target repository.%0A%0ATerraform will upload the contents of the following directory,%0Aexcluding files or directories as defined by a .terraformignore file%0Aat /home/runner/work/infra/infra/.terraformignore (if it is present),%0Ain order to capture the filesystem context the remote workspace expects:%0A    /home/runner/work/infra/infra%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/mirror_kt/infra/runs/run-c9h6rWxULGbSkD9a%0A%0AWaiting for 1 run(s) to finish before being queued...%0AWaiting for 1 run(s) to finish before being queued... (30s elapsed)%0A%0ATerraform v1.5.2%0Aon linux_amd64%0AInitializing plugins and modules...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # cloudflare_record.dmarc will be created%0A  + resource "cloudflare_record" "dmarc" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "_dmarc"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "TXT"%0A      + value           = "v=DMARC1; p=quarantine; rua=mailto:dmarc@mirror-kt.dev"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.dub_sh will be created%0A  + resource "cloudflare_record" "dub_sh" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "s"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "CNAME"%0A      + value           = "cname.dub.sh"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.github_pages_challenge will be created%0A  + resource "cloudflare_record" "github_pages_challenge" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "_github-pages-challenge-mirror-kt"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "TXT"%0A      + value           = "5ccd0ccb2e561700cb4bc02bfb98f1"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.keybase will be created%0A  + resource "cloudflare_record" "keybase" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "_keybase"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "TXT"%0A      + value           = "keybase-site-verification=BUwOwC7eaSNWlnpB9toKGrkWPbK8Mnx5C4p1_PxLENE"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.mail will be created%0A  + resource "cloudflare_record" "mail" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "mirror-kt.dev"%0A      + priority        = 0%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "MX"%0A      + value           = "www2800.sakura.ne.jp"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.mc_chun_1 will be created%0A  + resource "cloudflare_record" "mc_chun_1" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "mc.chun"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "NS"%0A      + value           = "columbus.aternos.org"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.mc_chun_2 will be created%0A  + resource "cloudflare_record" "mc_chun_2" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "mc.chun"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "NS"%0A      + value           = "galileo.aternos.org"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.pleroma will be created%0A  + resource "cloudflare_record" "pleroma" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "pleroma"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "A"%0A      + value           = "34.134.233.145"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.root will be created%0A  + resource "cloudflare_record" "root" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "mirror-kt.dev"%0A      + proxiable       = (known after apply)%0A      + proxied         = true%0A      + ttl             = 1%0A      + type            = "CNAME"%0A      + value           = "mirror-kt.pages.dev"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.spf will be created%0A  + resource "cloudflare_record" "spf" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "mirror-kt.dev"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "TXT"%0A      + value           = "v=spf1 include:www2800.sakura.ne.jp ~all"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A%0A%0Acloudflare_record.spf: Creating...%0Acloudflare_record.pleroma: Creating...%0Acloudflare_record.keybase: Creating...%0Acloudflare_record.mc_chun_1: Creating...%0Acloudflare_record.root: Creating...%0Acloudflare_record.mc_chun_2: Creating...%0Acloudflare_record.dub_sh: Creating...%0Acloudflare_record.mail: Creating...%0Acloudflare_record.dmarc: Creating...%0Acloudflare_record.github_pages_challenge: Still creating... [10s elapsed]%0Acloudflare_record.keybase: Still creating... [10s elapsed]%0Acloudflare_record.pleroma: Still creating... [10s elapsed]%0Acloudflare_record.spf: Still creating... [10s elapsed]%0Acloudflare_record.mc_chun_1: Still creating... [10s elapsed]%0Acloudflare_record.root: Still creating... [10s elapsed]%0Acloudflare_record.mc_chun_2: Still creating... [10s elapsed]%0Acloudflare_record.dub_sh: Still creating... [10s elapsed]%0Acloudflare_record.dmarc: Still creating... [10s elapsed]%0Acloudflare_record.mail: Still creating... [10s elapsed]%0Acloudflare_record.github_pages_challenge: Still creating... [20s elapsed]%0Acloudflare_record.spf: Still creating... [20s elapsed]%0Acloudflare_record.pleroma: Still creating... [20s elapsed]%0Acloudflare_record.keybase: Still creating... [20s elapsed]%0Acloudflare_record.mc_chun_1: Still creating... [20s elapsed]%0Acloudflare_record.root: Still creating... [20s elapsed]%0Acloudflare_record.mc_chun_2: Still creating... [20s elapsed]%0Acloudflare_record.dub_sh: Still creating... [20s elapsed]%0Acloudflare_record.mail: Still creating... [20s elapsed]%0Acloudflare_record.dmarc: Still creating... [20s elapsed]%0Acloudflare_record.github_pages_challenge: Still creating... [30s elapsed]%0Acloudflare_record.pleroma: Still creating... [30s elapsed]%0Acloudflare_record.spf: Still creating... [30s elapsed]%0Acloudflare_record.keybase: Still creating... [30s elapsed]%0Acloudflare_record.root: Still creating... [30s elapsed]%0Acloudflare_record.mc_chun_1: Still creating... [30s elapsed]%0Acloudflare_record.mc_chun_2: Still creating... [30s elapsed]%0Acloudflare_record.dub_sh: Still creating... [30s elapsed]%0Acloudflare_record.mail: Still creating... [30s elapsed]%0Acloudflare_record.dmarc: Still creating... [30s elapsed]%0A╷%0A│ Error: expected DNS record to not already be present but already exists%0A│ %0A│   with cloudflare_record.pleroma,%0A│   on cloudflare_dns_records.tf line 1, in resource "cloudflare_record" "pleroma":%0A│    1: resource "cloudflare_record" "pleroma" {%0A│ %0A╵%0A╷%0A│ Error: expected DNS record to not already be present but already exists%0A│ %0A│   with cloudflare_record.root,%0A│   on cloudflare_dns_records.tf line 10, in resource "cloudflare_record" "root":%0A│   10: resource "cloudflare_record" "root" {%0A│ %0A╵%0A╷%0A│ Error: expected DNS record to not already be present but already exists%0A│ %0A│   with cloudflare_record.dub_sh,%0A│   on cloudflare_dns_records.tf line 19, in resource "cloudflare_record" "dub_sh":%0A│   19: resource "cloudflare_record" "dub_sh" {%0A│ %0A╵%0A╷%0A│ Error: expected DNS record to not already be present but already exists%0A│ %0A│   with cloudflare_record.mail,%0A│   on cloudflare_dns_records.tf line 28, in resource "cloudflare_record" "mail":%0A│   28: resource "cloudflare_record" "mail" {%0A│ %0A╵%0A╷%0A│ Error: expected DNS record to not already be present but already exists%0A│ %0A│   with cloudflare_record.spf,%0A│   on cloudflare_dns_records.tf line 38, in resource "cloudflare_record" "spf":%0A│   38: resource "cloudflare_record" "spf" {%0A│ %0A╵%0A╷%0A│ Error: expected DNS record to not already be present but already exists%0A│ %0A│   with cloudflare_record.mc_chun_1,%0A│   on cloudflare_dns_records.tf line 47, in resource "cloudflare_record" "mc_chun_1":%0A│   47: resource "cloudflare_record" "mc_chun_1" {%0A│ %0A╵%0A╷%0A│ Error: expected DNS record to not already be present but already exists%0A│ %0A│   with cloudflare_record.mc_chun_2,%0A│   on cloudflare_dns_records.tf line 56, in resource "cloudflare_record" "mc_chun_2":%0A│   56: resource "cloudflare_record" "mc_chun_2" {%0A│ %0A╵%0A╷%0A│ Error: expected DNS record to not already be present but already exists%0A│ %0A│   with cloudflare_record.dmarc,%0A│   on cloudflare_dns_records.tf line 65, in resource "cloudflare_record" "dmarc":%0A│   65: resource "cloudflare_record" "dmarc" {%0A│ %0A╵%0A╷%0A│ Error: expected DNS record to not already be present but already exists%0A│ %0A│   with cloudflare_record.github_pages_challenge,%0A│   on cloudflare_dns_records.tf line 74, in resource "cloudflare_record" "github_pages_challenge":%0A│   74: resource "cloudflare_record" "github_pages_challenge" {%0A│ %0A╵%0A╷%0A│ Error: expected DNS record to not already be present but already exists%0A│ %0A│   with cloudflare_record.keybase,%0A│   on cloudflare_dns_records.tf line 83, in resource "cloudflare_record" "keybase":%0A│   83: resource "cloudflare_record" "keybase" {%0A│ %0A╵%0AOperation failed: failed running terraform apply (exit 1)%0A
::debug::stderr: 
::debug::exitcode: 1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"0ae999e1d5614c321c18b18631a26d3b9898a235","Vars":{},"WorkflowName":"Terraform"} -->